TRAITEMENT DE DOUBLONS

In [1]:
import seaborn as sb 

df = sb.load_dataset('titanic').loc[:, ['sex',
                                        'age',
                                        'sibsp',
                                        'parch', 
                                        'fare',
                                        'embarked',
                                        'class',
                                        'who',
                                        'adult_male',
                                        'embark_town',
                                        'alive'
                                        ]
                                    ]
print(df.shape)
df.head()

(891, 11)

,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive
0,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no
1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes
2,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes
3,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes
4,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no

---

DONNEES DUPLIQUEES(REDONDANCES) DANS TOUT LE DATASET
- existance 
- nombre d'enregistrements dupliques

In [3]:
df.loc[df.duplicated(),:].head()

,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive
47,female,NaN,0,0,7.7500,Q,Third,woman,False,Queenstown,yes
76,male,NaN,0,0,7.8958,S,Third,man,True,Southampton,no
77,male,NaN,0,0,8.0500,S,Third,man,True,Southampton,no
87,male,NaN,0,0,8.0500,S,Third,man,True,Southampton,no
95,male,NaN,0,0,8.0500,S,Third,man,True,Southampton,no

In [4]:
df.loc[df.duplicated(),:].shape

(111, 11)

In [5]:
df.duplicated().sum()

111

---

SUPPRESSION DE REDONDANCES

In [11]:
df.drop_duplicates(keep = 'last', inplace = True)

In [12]:
df.drop_duplicates(keep = 'first', inplace = True)

In [13]:
df.drop_duplicates(keep = False) # , inplace = True

,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive
0,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no
1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes
2,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes
3,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes
5,male,NaN,0,0,8.4583,Q,Third,man,True,Queenstown,no
...,...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no
887,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes
888,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no
889,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes
890,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no

In [14]:
df[df.duplicated()]

Empty DataFrame
Columns: [sex, age, sibsp, parch, fare, embarked, class, who, adult_male, embark_town, alive]
Index: []

- identification & suppression par colonne / ensemble de colonnes

In [15]:
df.loc[df.duplicated(subset = ['age','class','embark_town'])].shape

(500, 11)

In [18]:
df.drop_duplicates(subset = ['age','class','embark_town'], inplace = True) #

In [19]:
df.loc[df.duplicated(subset = ['age','class','embark_town'])]

Empty DataFrame
Columns: [sex, age, sibsp, parch, fare, embarked, class, who, adult_male, embark_town, alive]
Index: []

In [1]:
print('je commente la video et je la partage sur les reseaux sociaux, merci  üëç')

je commente la video et je la partage sur les reseaux sociaux, merci  üëç

- **R√©joindre la communaut√© openclass4all** üëá
 - https://www.youtube.com/channel/UCE-613S-bsuLukwHDhnRxIA/?sub_confirmation=1

- **Vid√©o associ√©e √† ce notebook** üëá
 - https://youtu.be/Syp2mWkyt3U
 
- **Merci d'ajouter une √©toile √† mon profil github si vous pensez que le travail que je fais est utile**.